Request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sec="http://schemas.xmlsoap.org/ws/2002/12/secext" xmlns:mes="http://www.ebxml.org/namespaces/messageHeader" xmlns:v3="http://services.sabre.com/sp/pd/v3_2">
  <soapenv:Header>
    <sec:Security>
      <sec:UsernameToken>
        <sec:Username/>
        <sec:Password/>
        <sec:NewPassword/>
        <Organization/>
        <Domain/>
      </sec:UsernameToken>
      <sec:SabreAth/>
      <sec:BinarySecurityToken>{{key}}</sec:BinarySecurityToken>
    </sec:Security>
    <mes:MessageHeader mes:id="" mes:version="">
      <mes:From>
        <mes:PartyId mes:type=""/>
        <mes:Role/>
      </mes:From>
      <mes:To>
        <mes:PartyId mes:type=""/>
        <mes:Role/>
      </mes:To>
      <mes:CPAId/>
      <mes:ConversationId>OTA_HotelAvailLLSRQ</mes:ConversationId>
      <mes:Service mes:type=""/>
      <mes:Action>OTA_HotelAvailLLSRQ</mes:Action>
      <mes:MessageData>
        <mes:MessageId/>
        <mes:Timestamp/>
        <mes:RefToMessageId/>
        <mes:TimeToLive/>
        <mes:Timeout>60</mes:Timeout>
      </mes:MessageData>
      <mes:DuplicateElimination/>
      <mes:Description xml:lang=""/>
    </mes:MessageHeader>
  </soapenv:Header>
  <soapenv:Body>
    <OTA_HotelAvailRQ Version="2.2.1" ReturnHostCommand="true" xmlns="http://webservices.sabre.com/sabreXML/2011/10">
      <AvailRequestSegment>
        <!--<Customer>
           <Corporate>
              <ID>ABC123</ID>
           </Corporate>
        </Customer>
-->
        <GuestCounts Count="{{pessoas}}"/>
        <HotelSearchCriteria>
          <Criterion>
            <HotelRef HotelCityCode="{{iata}}"/>
          </Criterion>
        </HotelSearchCriteria>
        <TimeSpan End="{{end}}" Start="{{start}}"/>
      </AvailRequestSegment>
    </OTA_HotelAvailRQ>
  </soapenv:Body>
</soapenv:Envelope>
